Revit 2024 API
Document.GetSubelement Method
Overload List
Name | Description
GetSubelement(String)
 Gets the subelement referenced by a unique id string.
GetSubelement(Reference)
 Gets the subelement referenced by the input reference.
GetSubelement(ElementId, Int32)
 Gets the subelement referenced by a parent id and subelement id.
See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace